
Процедура ксп_ПриЗаписиДокументаПриЗаписи(Источник, Отказ) Экспорт

	Узел = Константы.УзелОбменаRabbitMQ.Получить();
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		
		ЗаписьЖурналаРегистрации("Экспорт_из_ЕРП", УровеньЖурналаРегистрации.Предупреждение,,Источник.Ссылка,
			"Не установлена константа УзелОбменаRabbitMQ! Регистрация документа в плане обмена Кодерлайн_интеграция не выполнена!");
		Возврат;
	КонецЕсли;

	ПланыОбмена.ЗарегистрироватьИзменения(Узел, Источник.Ссылка);
	
КонецПроцедуры

Процедура ксп_ПриЗаписиСправочникаПриЗаписи(Источник, Отказ) Экспорт

	Узел = Константы.УзелОбменаRabbitMQ.Получить();
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		
		ЗаписьЖурналаРегистрации("Экспорт_из_ЕРП", УровеньЖурналаРегистрации.Предупреждение,,Источник.Ссылка,
			"Не установлена константа УзелОбменаRabbitMQ! Регистрация справочника в плане обмена Кодерлайн_интеграция не выполнена!");
		Возврат;
	КонецЕсли;

	ПланыОбмена.ЗарегистрироватьИзменения(Узел, Источник.Ссылка);
	
КонецПроцедуры
