
// Описание_метода
//
// Параметры:
//	ТипСклада 	- строка - 
//
// Возвращаемое значение:
//	Тип: перечисление  ТипыСкладов
//
Функция ПоМэппингу(ТипСклада) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.ТипСклада КАК ТипСклада
		|ИЗ
		|	РегистрСведений.ксп_МэппингТипыСкладов КАК Рег
		|ГДЕ
		|	Рег.Значение = &ТипСклада";
	
	Запрос.УстановитьПараметр("ТипСклада", ТипСклада);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ТипСклада;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
