
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ПоМэппингу(Склад, ВнешняяСистема) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ксп_МэппингСкладМагазин.Магазин КАК Магазин
		|ИЗ
		|	РегистрСведений.ксп_МэппингСкладМагазин КАК ксп_МэппингСкладМагазин
		|ГДЕ
		|	ксп_МэппингСкладМагазин.Склад = &Склад
		|	И ксп_МэппингСкладМагазин.ВнешняяСистема = &ВнешняяСистема";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Магазин;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
