
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьЗапись(СсылкаНаОбъект, ТекстJson) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекстJson) Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ПериодМс = ТекущаяУниверсальнаяДатаВМиллисекундах();
	НЗ = РегистрыСведений.ксп_ИсходныеДанныеСообщений.СоздатьНаборЗаписей();
	НЗ.Отбор.СсылкаНаОбъект.Установить(СсылкаНаОбъект);
	НЗ.Отбор.ПериодМс.Установить(ПериодМс);
	стрк = НЗ.Добавить();
	стрк.СсылкаНаОбъект = СсылкаНаОбъект;
	стрк.ПериодМс = ПериодМс;
	стрк.ТекстJson = ТекстJson;
	стрк.МоментВремениЗаписи = ТекущаяДатаСеанса();
	НЗ.Записать();
		
КонецПроцедуры
