
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьЗапись(ДокСсылка, ТекстJson) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекстJson) Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПериодМс = ТекущаяУниверсальнаяДатаВМиллисекундах();
	НЗ = РегистрыСведений.ксп_ИсходныеДанныеСообщений.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокСсылка.Установить(ДокСсылка);
	НЗ.Отбор.ПериодМс.Установить(ПериодМс);
	стрк = НЗ.Добавить();
	стрк.ДокСсылка = ДокСсылка;
	стрк.ПериодМс = ПериодМс;
	стрк.ДокСсТекстJsonылка = ТекстJson;
	НЗ.Записать();
		
КонецПроцедуры
