

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ЗафиксироватьСозданиеПеремещения(
		ВнешняяСистема, 
		ЗаказНаПеремещениеГУИД, 
		РасходныйОрдерГУИД, 
		ПеремещениеТоваровСсылка) Экспорт
		
		
	Мен_ = РегистрыСведений.ксп_ИсточникДанныхДляПеремещенийТоваровИзЕРП.СоздатьМенеджерЗаписи();
	Мен_.ВнешняяСистема = ВнешняяСистема;
	Мен_.ЗаказНаПеремещениеГУИД = ЗаказНаПеремещениеГУИД;
	Мен_.РасходныйОрдерГУИД = РасходныйОрдерГУИД;
	Мен_.Прочитать();
	Если Мен_.Выбран() Тогда
		Мен_.ПеремещениеТоваровРозница = ПеремещениеТоваровСсылка;
		Мен_.ДатаСозданияПеремещения = ТекущаяДатаСеанса();
		Мен_.Записать();
	КонецЕсли;
		
КонецПроцедуры


// Фиксирует загрузку документа РасходныйОрдерНаТовары из ЕРП 
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьЗапись(ЗаказНаПеремещениеГУИД, 
	РасходныйОрдерГУИД,
	ВнешняяСистема) Экспорт
	
	
	НЗ = РегистрыСведений.ксп_ИсточникДанныхДляПеремещенийТоваровИзЕРП.СоздатьНаборЗаписей();
	НЗ.Отбор.ВнешняяСИстема.Установить(ВнешняяСистема);
	НЗ.Отбор.ЗаказНаПеремещениеГУИД.Установить(ЗаказНаПеремещениеГУИД);
	НЗ.Отбор.РасходныйОрдерГУИД.Установить(РасходныйОрдерГУИД);
	
	НовСтр = НЗ.Добавить();
	НовСтр.ВнешняяСистема = ВнешняяСистема;
	НовСтр.ЗаказНаПеремещениеГУИД = ЗаказНаПеремещениеГУИД;
	НовСтр.РасходныйОрдерГУИД = РасходныйОрдерГУИД;
	НовСтр.ДатаЗагрузкиИзЕРП = ТекущаяДатаСеанса();
	
	
	НЗ.Записать();
	
		
КонецПроцедуры
