

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ЗафиксироватьСозданиеПеремещения(
		ВнешняяСистема, 
		ЗаказНаПеремещениеГУИД, 
		РасходныйОрдерГУИД, 
		ПеремещениеТоваровСсылка) Экспорт
		
		
	Мен_ = РегистрыСведений.ксп_ИсточникДанныхДляПеремещенийТоваровИзЕРП.СоздатьМенеджерЗаписи();
	Мен_.ВнешняяСистема = ВнешняяСистема;
	Мен_.ЗаказНаПеремещениеГУИД = ЗаказНаПеремещениеГУИД;
	Мен_.РасходныйОрдерГУИД = РасходныйОрдерГУИД;
	Мен_.Прочитать();
	Если Мен_.Выбран() Тогда
		Мен_.ПеремещениеТоваровРозница = ПеремещениеТоваровСсылка;
		Мен_.ДатаСозданияПеремещения = ТекущаяДатаСеанса();
		Мен_.Записать();
	КонецЕсли;
		
КонецПроцедуры


// Фиксирует загрузку документа РасходныйОрдерНаТовары из ЕРП 
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьЗапись(ЗаказНаПеремещениеГУИД, 
	РасходныйОрдерГУИД,
	ВнешняяСистема) Экспорт
	
	
	НЗ = РегистрыСведений.ксп_ИсточникДанныхДляПеремещенийТоваровИзЕРП.СоздатьНаборЗаписей();
	НЗ.Отбор.ВнешняяСИстема.Установить(ВнешняяСистема);
	НЗ.Отбор.ЗаказНаПеремещениеГУИД.Установить(ЗаказНаПеремещениеГУИД);
	НЗ.Отбор.РасходныйОрдерГУИД.Установить(РасходныйОрдерГУИД);
	
	НовСтр = НЗ.Добавить();
	НовСтр.ВнешняяСистема = ВнешняяСистема;
	НовСтр.ЗаказНаПеремещениеГУИД = ЗаказНаПеремещениеГУИД;
	НовСтр.РасходныйОрдерГУИД = РасходныйОрдерГУИД;
	НовСтр.ДатаЗагрузкиИзЕРП = ТекущаяДатаСеанса();
	
	
	НЗ.Записать();
	
		
КонецПроцедуры



// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ГуидЗаказаПоПеремещению(ПеремещениеТоваровСсылка)Экспорт    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.ЗаказНаПеремещениеГУИД КАК ЗаказНаПеремещениеГУИД
		|ИЗ
		|	РегистрСведений.ксп_ИсточникДанныхДляПеремещенийТоваровИзЕРП КАК Рег
		|ГДЕ
		|	Рег.ПеремещениеТоваровРозница = &ПеремещениеТоваровСсылка";
	
	Запрос.УстановитьПараметр("ПеремещениеТоваровСсылка", ПеремещениеТоваровСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ЗаказНаПеремещениеГУИД;
	КонецЦикла;
			
	Возврат "";
	
КонецФункции
