
// Описание_метода
//
// Параметры:
//	ГУИД 	- строка - 
//	ВнешняяСистема - строка- ИД внешней системы
//
// Возвращаемое значение:
//	Тип: структура 
//
Функция ДанныеДокумента(ГУИД, ВнешняяСистема) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ксп_ЗаказНаПеремещение_ЕРП.ВнешняяСистема КАК ВнешняяСистема,
		|	ксп_ЗаказНаПеремещение_ЕРП.ГУИД КАК ГУИД,
		|	ксп_ЗаказНаПеремещение_ЕРП.ДатаДокумента КАК ДатаДокумента,
		|	ксп_ЗаказНаПеремещение_ЕРП.НомерДокумента КАК НомерДокумента,
		|	ксп_ЗаказНаПеремещение_ЕРП.Проведен КАК Проведен,
		|	ксп_ЗаказНаПеремещение_ЕРП.ПометкаУдаления КАК ПометкаУдаления,
		|	ксп_ЗаказНаПеремещение_ЕРП.ДлительностьПеремещения КАК ДлительностьПеремещения,
		|	ксп_ЗаказНаПеремещение_ЕРП.ЖелаемаяДатаПоступления КАК ЖелаемаяДатаПоступления,
		|	ксп_ЗаказНаПеремещение_ЕРП.Комментарий КАК Комментарий,
		|	ксп_ЗаказНаПеремещение_ЕРП.МаксимальныйКодСтроки КАК МаксимальныйКодСтроки,
		|	ксп_ЗаказНаПеремещение_ЕРП.Организация КАК Организация,
		|	ксп_ЗаказНаПеремещение_ЕРП.ОрганизацияПолучатель КАК ОрганизацияПолучатель,
		|	ксп_ЗаказНаПеремещение_ЕРП.Ответственный КАК Ответственный,
		|	ксп_ЗаказНаПеремещение_ЕРП.Подразделение КАК Подразделение,
		|	ксп_ЗаказНаПеремещение_ЕРП.Сделка КАК Сделка,
		|	ксп_ЗаказНаПеремещение_ЕРП.СкладОтправитель КАК СкладОтправитель,
		|	ксп_ЗаказНаПеремещение_ЕРП.СкладПолучатель КАК СкладПолучатель,
		|	ксп_ЗаказНаПеремещение_ЕРП.Статус КАК Статус,
		|	ксп_ЗаказНаПеремещение_ЕРП.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ксп_ЗаказНаПеремещение_ЕРП.Назначение КАК Назначение,
		|	ксп_ЗаказНаПеремещение_ЕРП.ДокументОснование КАК ДокументОснование,
		|	ксп_ЗаказНаПеремещение_ЕРП.СостояниеЗаполненияМногооборотнойТары КАК СостояниеЗаполненияМногооборотнойТары,
		|	ксп_ЗаказНаПеремещение_ЕРП.СпособДоставки КАК СпособДоставки,
		|	ксп_ЗаказНаПеремещение_ЕРП.ПеревозчикПартнер КАК ПеревозчикПартнер,
		|	ксп_ЗаказНаПеремещение_ЕРП.ЗонаДоставки КАК ЗонаДоставки,
		|	ксп_ЗаказНаПеремещение_ЕРП.ВремяДоставкиС КАК ВремяДоставкиС,
		|	ксп_ЗаказНаПеремещение_ЕРП.ВремяДоставкиПо КАК ВремяДоставкиПо,
		|	ксп_ЗаказНаПеремещение_ЕРП.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
		|	ксп_ЗаказНаПеремещение_ЕРП.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
		|	ксп_ЗаказНаПеремещение_ЕРП.АдресДоставкиПеревозчикаЗначенияПолей КАК АдресДоставкиПеревозчикаЗначенияПолей,
		|	ксп_ЗаказНаПеремещение_ЕРП.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
		|	ксп_ЗаказНаПеремещение_ЕРП.АдресДоставки КАК АдресДоставки,
		|	ксп_ЗаказНаПеремещение_ЕРП.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
		|	ксп_ЗаказНаПеремещение_ЕРП.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
		|	ксп_ЗаказНаПеремещение_ЕРП.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ксп_ЗаказНаПеремещение_ЕРП.ИспользоватьДлительностьПеремещения КАК ИспользоватьДлительностьПеремещения,
		|	ксп_ЗаказНаПеремещение_ЕРП.ПеремещениеПодДеятельность КАК ПеремещениеПодДеятельность,
		|	ксп_ЗаказНаПеремещение_ЕРП.ОбосабливатьПоНазначениюЗаказа КАК ОбосабливатьПоНазначениюЗаказа,
		|	ксп_ЗаказНаПеремещение_ЕРП.ВариантПриемкиТоваров КАК ВариантПриемкиТоваров,
		|	ксп_ЗаказНаПеремещение_ЕРП.Приоритет КАК Приоритет,
		|	ксп_ЗаказНаПеремещение_ЕРП.Автор КАК Автор,
		|	ксп_ЗаказНаПеремещение_ЕРП.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
		|	ксп_ЗаказНаПеремещение_ЕРП.АдресДоставкиПеревозчикаЗначение КАК АдресДоставкиПеревозчикаЗначение
		|ИЗ
		|	РегистрСведений.ксп_ЗаказНаПеремещение_ЕРП КАК ксп_ЗаказНаПеремещение_ЕРП
		|ГДЕ
		|	ксп_ЗаказНаПеремещение_ЕРП.ГУИД = &ГУИД
		|	И ксп_ЗаказНаПеремещение_ЕРП.ВнешняяСистема = &ВнешняяСистема";
	
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	Запрос.УстановитьПараметр("ГУИД", ГУИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Рез  = Новый структура;
	
	ТЗ = РезультатЗапроса.Выгрузить();
	Для каждого стрк Из ТЗ Цикл
		Для каждого кол Из ТЗ.Колонки Цикл
			Рез.Вставить(кол.Имя, стрк[кол.Имя]);
		КонецЦикла;
		
	КонецЦикла;

	Возврат Рез;
	
КонецФункции
