
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьЗапись(ВнешняяСистема, ДанныеСсылка, ВерсияДанных) Экспорт
	
	НаборЗаписей = РегистрыСведений.ксп_Версии_Документ_ВнесениеДенежныхСредствВКассуККМ
		                                     .СоздатьНаборЗаписей();
											 
	НаборЗаписей.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
	НаборЗаписей.Отбор.ДанныеСсылка.Установить(ДанныеСсылка);
	
	НовСтр = НаборЗаписей.Добавить();
	НовСтр.ВнешняяСистема = ВнешняяСистема;
	НовСтр.ДанныеСсылка = ДанныеСсылка;
	НовСтр.ВерсияДанных = ВерсияДанных;
	НовСтр.МоментЗаписи = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();
КонецПроцедуры
